#####################数据结构###############################
#
#   1.向量
#     1.1.c()创建向量
#       向量中的元素必须是同一类型
#     1.2.向量索引
#       []        [元素位置]
#       which()   which方式索引(元素的位置)
#       subset()  检索向量中满足条件的元素
#       match()   判断向量中的元素是否等于()
#       %in%      判断向量中是否包含某项数据
#     1.3.元素命名
#       names(x1) <- c('one','two','three','four')
#     1.4..向量的编辑
#     扩展c()
#
#   2.因子factor(1,2,3)
#
#
#   3.数组
#
#   4.矩阵
#
#   5.数据框
#
#   6.时间序列(ts)
#
#   7.列表
#
############################################################


#创建向量
x1 <- c(1:5)
x1 <- c(1,2,3,4)
x1 <- c('1','2','3')
x1 <- c(TRUE,FALSE)
sapply(x1,mode)

#向量索引
x1[1]
x1[-1]
x1[c(1:3)]
x1[-c(1:3)]
x1[c(TRUE,TRUE,FALSE)]

#元素命名
names(x1) <- c('one','two','three','four')
#按名字索引
x1[c('one','two')]

#which索引
which(x1 ==1)
which(x1 == c(1,2))
which(x1 != 1)
which(x1 > 2)
which(x1 > 2 & x1 < 4)
which.max(x1)
which.min(x1)

#subset
subset(x1,x1>2 & x1<4)

#match
match(x1,c(1,2))

c(1.4) %in% x1

#######################
#扩展
x1 <- c(x1,c(5,6,7,8))

#删除
x1 <- x1[-8]
x1 <- x1[c(3:5)]

#######################
#排序
x <- c(5, 6, 8, 7, 4, 1, 9)
x1 <- c("B", "A", "C")
x2 <- c(3, 2, NA, 1, 4, 5)
sort(x1)
rev(x1)  #反序
# 数值型数据排序（默认顺序为升序）
sort(x, decreasing = FALSE) #升序 
sort(x, decreasing = TRUE)  #降序
sort(x2, na.last = TRUE) #把na值放到最后排序

########################
#等差序列  seq()
seq(1, -9)  # 只给出首项和尾项数据，by自动匹配为1或-1
seq(1, -9, length.out = 5)  # 给出首项和尾项数据以及长度，自动计算等差
seq(1, -9, by = -2)  # 给出首项和尾项数据以及等差，自动计算长度
seq(1, by = 2, length.out = 10) #给出首项和等差以及序列长度数据，自动计算尾项

#重复序列
rep(1:3, 2)  # 重复序列两次
rep(1:3, each = 2)  # 序列中各个元素分别重复两次
rep(1:3, c(2, 1, 2))  # 按照规则重复序列中的各个元素
rep(1:3, each = 2, length.out = 4)  # 序列中各个元素分别重复两次，规定生成序列的长度为4
rep(1:3, each = 2, times = 3)  # 序列中各个元素分别重复两次，整个序列重复3次
rep(as.factor(c("因子1", "因子2", "因子3")), 3)  # 将因子型变量序列重复3次

########################
#矩阵：二维数组
#创建矩阵  matrix
x <- c(1:10)
(a <- matrix(x, ncol = 2, nrow = 5, byrow = T))
b <- matrix(x)
dim(b) <- c(5, 2) 
#矩阵的运算
t(a)    #转秩
a+b   #加法
a-b   #减法
a%*%b #乘法
diag(a)  #对角线
diag(4) #产生4阶单位矩阵

a <- matrix(rnorm(16),4,4)
solve(a)  #逆矩阵




