数据挖掘算法分类

有监督学习算法，无监督学习算法，推荐系统
    有监督算法：线性回归，逻辑回归、决策树、神经网络
    无监督学习：聚类、最邻近距离、支持向量机等不过这些都是比较通用的算法。
    
    
k-近邻算法，线性回归，朴素贝叶斯算法，局部加权线性回归，支持向量机，Ridge回归，决策树

无监督学习的用途 
K-均值，
最大期望算法
DBSCAN


    
无监督和有监督区别
1、无监督与监督学习的区别在于一个无教学值，一个有教学值。但是，个人认为他们的区别在于无监督学习一般是采用聚簇等算法来分类不同样本。而监督学习一般是利用教学值与实际输出值产生的误差，进行误差反向传播修改权值来完成网络修正的。但是无监督学习没有反向传播修改权值操作。
 
2、样本全部带标记/样本全部不带标记··· PS:部分带标记的是半监督学习
 
3、训练集有输入有输出是有监督，包括所有的回归算法分类算法，比如线性回归、决策树、神经网络、KNN、SVM等；训练集只有输入没有输出是无监督，包括所有的聚类算法，比如k-means 、PCA、 GMM等
 
有监督学习：对具有概念标记（分类）的训练样本进行学习，以尽可能对训练样本集外的数据进行标记（分类）预测。这里，所有的标记（分类）是已知的。因此，训练样本的岐义性低。

无监督学习：对没有概念标记（分类）的训练样本进行学习，以发现训练样本集中的结构性知识。这里，所有的标记（分类）是未知的。因此，训练样本的岐义性高。聚类就是典型的无监督学习



